---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintArcLength
source: html/2d5e73c0-8a46-203d-d08b-c16ee6a46457.htm
---
# RebarShapeConstraintArcLength Methods

Return the Id of the parameter associated with this constraint.